# Preparação de Dados para Banco de Dados

Este notebook demonstra o processo de preparação de uma planilha para inserção em um banco de dados. Os passos incluem:
- Carregar o arquivo Excel
- Limpar e ajustar os dados
- Tratar valores nulos
- Exportar os dados para um banco de dados SQL

## 1. Carregar o arquivo Excel

In [1]:
import pandas as pd

# Carregar a planilha

file_path = 'Controle-Financeiro.xlsx'
xls = pd.ExcelFile(file_path)

# Carregar a planilha específica
df = xls.parse('Outubro', header=1)

# Exibir as primeiras linhas
df.head()

             Banco    Valor Vencimento Situação  Unnamed: 4  2000
0           Nubank  4764.84 2024-11-05      NaN         NaN   NaN
1  Banco do Brasil  1483.74 2024-11-07      NaN         NaN   NaN
2            Inter   910.09 2024-11-07      NaN         NaN   NaN
3          C6 Bank   194.93 2024-11-05      NaN         NaN   NaN
4             Next   459.81 2024-11-10      NaN         NaN   NaN

## 2. Limpeza e Ajuste de Dados

In [2]:
# Ajuste do nome das colunas
df.columns = ['Banco', 'Valor', 'Vencimento', 'Situacao', 'Extra', 'Caixa']

# Remover a coluna extra, se estiver vazia
df = df.drop(columns=['Extra'])

# Conversão de data para o formato datetime
df['Vencimento'] = pd.to_datetime(df['Vencimento'], errors='coerce')

# Verificar os tipos e valores nulos
df.info()

# Exibir uma amostra
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Banco       7 non-null      object
 1   Valor       6 non-null      float64
 2   Vencimento  6 non-null      datetime64[ns]
 3   Situacao    2 non-null      object
 4   Caixa       0 non-null      float64
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 412.0+ bytes

             Banco    Valor Vencimento Situacao  Caixa
0           Nubank  4764.84 2024-11-05      NaN    NaN
1  Banco do Brasil  1483.74 2024-11-07      NaN    NaN
2            Inter   910.09 2024-11-07      NaN    NaN
3          C6 Bank   194.93 2024-11-05      NaN    NaN
4             Next   459.81 2024-11-10      NaN    NaN

## 3. Tratamento de Valores Nulos

In [3]:
# Tratar valores nulos
df['Valor'] = df['Valor'].fillna(0)  # Substituir nulos de 'Valor' por 0
df['Caixa'] = df['Caixa'].fillna(0)  # Substituir nulos de 'Caixa' por 0
df['Situacao'] = df['Situacao'].fillna('')  # Substituir nulos de 'Situação' por vazio

# Exibir o DataFrame após tratamento
df.head()

             Banco    Valor Vencimento Situacao  Caixa
0           Nubank  4764.84 2024-11-05             0.0
1  Banco do Brasil  1483.74 2024-11-07             0.0
2            Inter   910.09 2024-11-07             0.0
3          C6 Bank   194.93 2024-11-05             0.0
4             Next   459.81 2024-11-10             0.0

In [4]:
print(df.columns)

Index(['Banco', 'Valor', 'Vencimento', 'Situacao', 'Caixa'], dtype='object')

In [5]:
# Remover a coluna extra, se estiver vazia
df = df.drop(columns=['Situacao'], axis=1)
df.head()

             Banco    Valor Vencimento  Caixa
0           Nubank  4764.84 2024-11-05    0.0
1  Banco do Brasil  1483.74 2024-11-07    0.0
2            Inter   910.09 2024-11-07    0.0
3          C6 Bank   194.93 2024-11-05    0.0
4             Next   459.81 2024-11-10    0.0

## 4. Salvar no Banco de Dados

In [7]:
%pip install psycopg2-binary

Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.10-cp312-cp312-win_amd64.whl.metadata (5.0 kB)
Downloading psycopg2_binary-2.9.10-cp312-cp312-win_amd64.whl (1.2 MB)
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ------------------ --------------------- 0.5/1.2 MB 2.4 MB/s eta 0:00:01
   ---------------------------------------- 1.2/1.2 MB 2.9 MB/s eta 0:00:00
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.10
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [10]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus

usuario = 'postgres'
senha = quote_plus('@manaus')
host = 'localhost'
porta = '5432'
nome_do_banco = 'db_financeiro'

# Configuração da conexão com o PostgreSQL
engine = create_engine(f'postgresql+psycopg2://{usuario}:{senha}@{host}:{porta}/{nome_do_banco}')

# Substitua "usuario", "senha", "host", "porta", e "nome_do_banco" pelos valores do seu banco de dados.
# Por exemplo:
# engine = create_engine('postgresql+psycopg2://meu_usuario:minha_senha@localhost:5432/meu_banco')

# Exportar o DataFrame para o banco de dados PostgreSQL
df.to_sql('controle_financeiro', con=engine, if_exists='replace', index=False)
print('Dados salvos com sucesso no banco de dados PostgreSQL.')

Dados salvos com sucesso no banco de dados PostgreSQL.

In [ ]:
# Query SQL para selecionar todos os dados da tabela
query = "SELECT * FROM controle_financeiro"

# Carregar os dados do banco de dados para um DataFrame
df = pd.read_sql(query, engine)

# Exportar para Excel
df.to_excel("controle_financeiro.xlsx", index=False)
print("Dados exportados com sucesso para controle_financeiro.xlsx")

Dados exportados com sucesso para controle_financeiro.xlsx